---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.#ctor
source: html/43e67b73-00f2-96ee-fa25-4841959066b2.htm
---
# Autodesk.Revit.DB.FillGrid.#ctor Method

Creates a simple fill grid.

## Syntax (C#)
```csharp
public FillGrid()
```